Repository: ioda-net/geo-infra
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Getting Started
fr: Guide de démarrage

source: Estimated time to complete: 3/4 hours.
fr: Temps estimé pour terminer ce guide : 3/4 h

source: Contents
fr: Table des matières

source: Requirements
fr: Prérequis

source: `Apache 2 <https://httpd.apache.org/>`__ with:
fr: `Apache 2 <https://httpd.apache.org/>`__ avec :

source: ``mod_rewrite``. To enable ``mod_rewrite`` on Debian based systems, use ``a2enmod rewrite``
fr: ``mod_rewrite``. Pour activer ``mod_rewrite`` sur des systèmes basés sur Debian, utiliser ``a2enmod rewrite``

source: ``mod_expires``. To enable ``mod_expires`` on Debian based systems, use ``a2enmod expires``
fr: ``mod_expires``. Pour activer ``mod_expires`` sur des systèmes basés sur Debian, utiliser ``a2enmod expires``

source: ``mod_headers``. To enable ``mod_headers`` on Debian based systems, use ``a2enmod headers``
fr: ``mod_headers``. Pour activer ``mod_headers`` sur des systèmes basés sur Debian, utiliser ``a2enmod headers``

source: ``mod_filter``. To enable ``mod_filter`` on Debian based systems, use ``a2enmode filter``
fr: ``mod_filter``. Pour activer ``mod_filter`` sur des systèmes basés sur Debian, utiliser ``a2enmode filter``

source: ``mod_deflate``. To enable ``mod_deflate`` on Debian based systems, use ``a2enmod deflate``
fr: ``mod_deflate``. Pour activer ``mod_deflate`` sur des systèmes basés sur Debian, utiliser ``a2enmod deflate``

source: ``mod_fcgid``. To enable ``mod_fcgid`` on Debian based systems install the ``libapache2-mod-fcgid`` package (``aptitude install libapache2-mod-fcgid``) and on openSuse, install ``apache2-mod_fcgid``.
fr: ``mod_fcgid``. Pour activer ``mod_fcgid`` sur des systèmes basés sur Debian, installer le paquet ``libapache2-mod-fcgid`` (``aptitude install libapache2-mod-fcgid``) et pour OpenSuse, installer ``apache2-mod_fcgid``.

source: ``mod_proxy``, ``mod_proxy_ajp`` and ``mod_proxy_http``. To enable ``mod_proxy``, ``mod_proxy_ajp`` and ``mod_proxy_http`` on Debian based systems, use ``a2enmod proxy``, ``a2enmod proxy_ajp`` and ``a2enmod proxy_http``.
fr: ``mod_proxy``, ``mod_proxy_ajp`` et ``mod_proxy_http``. Pour activer ``mod_proxy``, ``mod_proxy_ajp`` et ``mod_proxy_http`` sur des systèmes basés sur Debian, utiliser ``a2enmod proxy``, ``a2enmod proxy_ajp`` et ``a2enmod proxy_http``.

source: `Python <https://www.python.org/>`__ 3.4 or above with virtualenv capabilities (probably in the ``python3-venv`` package or included with your Python 3 install)
fr: `Python <https://www.python.org/>`__ 3.4 ou plus avec le support des virtualenv (probablement dans le paquet ``python3-venv`` ou inclus avec votre installation de Python 3)

source: `nodejs <http://nodejs.org/>`__ 4.0 or above
fr: `nodejs <http://nodejs.org/>`__ 4.0 ou plus

source: `MapServer <http://mapserver.org/>`__ 6.4.3+ (it will not work with 6.4.1) or 7.0.1+ (package commonly named ``mapserver`` on most distributions, on Debian based system, use ``cgi-mapserver`` and ``mapserver-bin``)
fr: `MapServer <http://mapserver.org/>`__ 6.4.3+ (ça ne fonctionnera pas avec 6.4.1) ou 7.0.1+ (paquet généralement appelé ``mapserver`` sur la plupart des distributions, sur les systèmes basés sur Debian, utiliser ``cgi-mapserver`` et ``mapserver-bin``)

source: `GDAL <http://www.gdal.org>`__ 2.0 or above with Python3 bindings
fr: `GDAL <http://www.gdal.org>`__ 2.0 ou plus avec les liaisons à Python3

source: `Sphinx search <http://sphinxsearch.com/>`__ 2.2 or above for the search features (package commonly named ``sphinx`` on most distributions, on Debian system, use ``sphinxsearch`` in Jessie backports)
fr: `Sphinx search <http://sphinxsearch.com/>`__ 2.2 ou plus pour la recherche d'éléments (paquet généralement appelé ``sphinx`` pour la plupart des distributions, sur les systèmes Debian, utiliser ``sphinxsearch`` sur les backports de Jessie)

source: `tomcat <http://tomcat.apache.org/>`__ 8.0 or above to deploy the print component
fr: `tomcat <http://tomcat.apache.org/>`__ 8.0 ou plus pour activer le composant d'impression

source: `Bash <http://www.gnu.org/software/bash>`__ 4 or above to launch the tasks
fr: `Bash <http://www.gnu.org/software/bash>`__ 4 ou plus pour lancer les tâches

source: `git <https://git-scm.com/>`__ 2.0 or above to get the code
fr: `git <https://git-scm.com/>`__ 2.0 ou plus pour obtenir le code

source: `proj <https://github.com/OSGeo/proj.4>`__ the cartographic projection software
fr: `proj <https://github.com/OSGeo/proj.4>`__ le logiciel de projections cartographiques

source: sudo to launch some commands with your normal user. Your ``/etc/sudoers`` file must contains the following lines (edit it with ``visudo``):
fr: sudo pour lancer certaines commandes avec un utilisateur normal. Votre fichier ``/etc/sudoers`` doit contenir les lignes suivantes (à éditer avec ``visudo``):

source: The following libraries to correctly create the Python venv:
fr: Les librairies suivantes pour créer correctement le venv Python:

source: On debian based system, use this list:
fr: Sur les systèmes basés sur Debian, utiliser cette liste:

source: Before we start
fr: Avant de démarrer

source: All tasks are launched here with `manuel <https://github.com/ShaneKilkelly/manuel>`__, a task runner written in Bash. To enable autocompletion in a Bash shell, source the ``geo-infra/manuel.autocomplete.bash`` file. `Completion is also available for zsh <https://github.com/ShaneKilkelly/manuel/blob/master/manuel.autocomplete.zsh>`__.
fr: Toutes les tâches sont lancées ici avec `manuel <https://github.com/ShaneKilkelly/manuel>`__, un task runner écrit en Bash. Pour avoir l'auto-complétion dans un shell Bash, utiliser le fichier ``geo-infra/manuel.autocomplete.bash``. `La complétion est aussi disponible pour zsh <https://github.com/ShaneKilkelly/manuel/blob/master/manuel.autocomplete.zsh>`__.

source: To launch ``manuel`` without always appending ``./`` copy ``geo-infra/manuel`` to your ``~/bin`` folder.
fr: Pour lancer ``manuel`` sans avoir à toujours ajouter ``./`` copier ``geo-infra/manuel`` dans votre dossier ``~/bin``.

source: To get help about any task (description of what it does and its arguments), use ``manuel help TASK``. For instance, ``manuel help help``.
fr: Pour obtenir de l'aide sur une tâche (description de ce qui est fait et des options), utiliser ``manuel help TASK``. par exemple, ``manuel help help``.

source: Setup the portal
fr: Paramétrisation du géoportail

source: Clone all the repositories listed below in the same folder [#clone_all_same_folder]_:
fr: Cloner tous les dépôts listés ci-dessus dans le même dossier [#clone_all_same_folder]_:

source: The main infrastructure directory: ``git clone https://github.com/ioda-net/geo-infra.git``
fr: L'infrastructure principale : ``git clone https://github.com/ioda-net/geo-infra.git``

source: The API: ``git clone https://github.com/ioda-net/geo-api3.git``
fr: L'API : ``git clone https://github.com/ioda-net/geo-api3.git``

source: The frontend: ``git clone https://github.com/ioda-net/geo-front3.git``
fr: L'interface : ``git clone https://github.com/ioda-net/geo-front3.git``

source: The sample customer infra: ``git clone https://github.com/ioda-net/customer-infra.git``
fr: L'infrastructure client servant d'exemple : ``git clone https://github.com/ioda-net/customer-infra.git``

source: Switch to ``customer-infra``:
fr: Passer sur ``customer-infra`` :

source: Download the ShapeFiles for Swisstzerland from `geofabrik <http://download.geofabrik.de/europe/switzerland-latest.shp.zip>`__ and uncompress it in ``customer-infra/data``:
fr: Télécharger les fichiers Shape pour la Suisse depuis `geofabrik <http://download.geofabrik.de/europe/switzerland-latest.shp.zip>`__ et les décompresser dans le dossier ``customer-infra/data`` :

source: You should now have a ``customer-infra/data/osm-swisstzeland`` folder containing various ShapeFiles.
fr: Vous avez maintenant un dossier ``customer-infra/data/osm-swisstzeland`` contenant différents fichiers Shape.

source: Add the symlink to the fonts:
fr: Ajouter le symlink pour les polices de caractères:

source: or on Debian system:
fr: ou sur un système Debian :

source: Update the configuration: in order to correctly test ``customer-infra`` for development, you only need to create ``customer-infra/config/dev/_common.dev.toml`` with the content below.
fr: Mettre à jour la configuration : afin de pouvoir tester ``customer-infra`` en développement, vous devez seulement créer ``customer-infra/config/dev/_common.dev.toml`` avec le contenu suivant :

source: In this folder, create a symlink to your mapserver executable named after the portal. For instance, using the values of ``config/dist/_common.dist.toml``, we have ``ln -s /usr/bin/mapserv ~/geoportal-infras/cgi-bin/demo``.
fr: Dans ce dossier, créer un lien symbolique vers votre exécutable mapserver, nommé selon le géoportail. Par exemple en utilisant les valeurs de ``config/dist/_common.dist.toml``, nous aurons ``ln -s /usr/bin/mapserv ~/geoportal-infras/cgi-bin/demo``.

source: Switch to ``geo-front3``:
fr: Aller sur ``geo-front3`` :

source: Launch ``npm install`` to install the node modules.
fr: Lancer ``npm install`` pour installer les modules node.

source: Switch to ``geo-infra``:
fr: Aller sur ``geo-infra`` :

source: Install the python dependencies listed in ``requires.txt``. You can install them globally with ``sudo pip install -r requires.txt`` or in a venv. If you use a version of Python below 3.5, you'll also need glob2. You can install it this way: ``sudo pip install glob2``. To install the dependencies in a venv, follow the steps below:
fr: Installer les dépendances python listées dans ``requires.txt``. Vous pouvez les installer toutes d'un coup de façon globale avec ``sudo pip install -r requires.txt`` ou dans un venv. Si vous utiliser une version de Python inférieure à 3.5, vous aurez aussi besoin de glob2. Vous pouvez l'installer de cette manière: ``sudo pip install glob2``. Pour installer les dépendances dans un venv, suivez les étapes décrites ci-dessous:

source: Create it: ``python3 -m venv .venv``
fr: Créer le venv: ``python3 -m venv .venv``

source: Activate it: ``source .venv/bin/activate`` **This must be done once before launching any command with manuel.**
fr: Activer-le : ``source .venv/bin/activate`` **Ceci doit être fait une fois avant de lancer n'importe quelle commande avec manuel.**

source: Install the deps: ``pip install -r requires.txt``
fr: Installer les dépendances : ``pip install -r requires.txt``

source: Install ``glob2`` if needed: ``pip install glob2``
fr: Installer ``glob2`` si nécessaire : ``pip install glob2``

source: Include all files in ``customer-infra/dev/vhosts.d`` in your apache configuration. This can be done be editing ``/etc/httpd/conf/httpd.conf`` or ``/etc/apache2/apache2.conf`` depending on your system and appending this line at the end of the file: ``IncludeOptional /path/to/infra/dir/customer-infra/dev/vhosts.d/*.conf``.
fr: Inclure tous les fichiers de ``customer-infra/dev/vhosts.d`` dans votre configuration apache. Ceci peut être fait en éditant ``/etc/httpd/conf/httpd.conf`` ou ``/etc/apache2/apache2.conf`` selon votre système et en ajoutant cette ligne à la fin du fichier : ``IncludeOptional /path/to/infra/dir/customer-infra/dev/vhosts.d/*.conf``.

source: Create the vhost: ``./manuel vhost demo``.
fr: Créer le vhost vhost : ``./manuel vhost demo``.

source: Create a symlink named ``mapserv`` to your MapServer executable in ``cgi-bin``. Eg: ``ln -s /usr/bin/mapserv cgi-bin/mapserv``.
fr: Créer un lien symbolique appelé ``mapserv`` vers votre executable MapServer dans ``cgi-bin``. Par exemple: ``ln -s /usr/bin/mapserv cgi-bin/mapserv``.

source: Generate the utility files: ``./manuel dev demo``.
fr: Générer les fichiers utilitaires du géoportail : ``./manuel dev demo``.

source: Generate the frontend: ``./manuel front dev demo``.
fr: Générer l'interface du géoportail : ``./manuel front dev demo``.

source: Add ``demo.geoportal.local`` to your ``/etc/hosts``.
fr: Ajouter ``demo.geoportal.local`` dans votre ``/etc/hosts``.

source: Open http://demo.geoportal.local.
fr: Ouvrir http://demo.geoportal.local.

source: You should see a portal. It should be similar to the image below. Please note that only map navigation is functionnal at this stage. The features that rely on the API (searches, QR code, shortener, get features) and print, will be enabled in the sections below.
fr: Vous devriez voir votre géoportail, semblable à l'image ci-dessous. Pour le moment, seule la navigation dans la carte est fonctionnelle. Les éléments dépendants de l'API (recherches, QR code, URL abrégée, informations sur les éléments) ainsi que l'impression seront mis en place dans la suite de ce guide.

source: Demo portal home page
fr: Page d'accueil du géoportail Demo

source: They can be arranged differently later if you override the proper values in ``geo-infra/config/config.sh``
fr: Ils peuvent être arrangés différement plus tard en surchargeant les bonnes clé dans dans ``geo-infra/config/config.sh``

source: Switch to ``geo-api3``:
fr: Aller sur ``geo-api3`` :

source: Update the configuration. To do that, create a file named ``config/config.devel.toml`` and adapt the content below to your use case:
fr: Mettre à jour la configuration. Pour faire ça, créer un fichier appelé ``config/config.devel.toml`` et adapter son contenu à votre cas de figure:

source: Download the `sample sqlite database file </data/getting-started/customer_infra.sqlite>`__ into the ``geo-api3`` folder:
fr: Télécharger le fichier d'exemple de la `base de données sqlite </data/getting-started/customer_infra.sqlite>`__ dans le dossier ``geo-api3`` :

source: Create the proper venv with ``./manuel venv``
fr: Créer le bon venv avec ``./manuel venv``

source: Update the ini files used by Pyramid: ``./manuel ini-files``.
fr: Mettre à jour les fichiers ini utilisés par Pyramid: ``./manuel ini-files``.

source: Launch the API: ``./manuel serve``.
fr: Lancer l'API : ``./manuel serve``.

source: If the command fails due to ``ImportError: No module named 'osgeo'``, check that the osgeo module from system install is available in the ``PYTHONPATH`` specificied in ``config/config.dist.sh``. If not, create a ``config/config.sh`` with the correct value for ``PYTHONPATH``. Eg for Debian, put this value:
fr: Si la commande échoue à cause de ``ImportError: No module named 'osgeo'``, vérifier que le module osgeo du système est disponible dans le ``PYTHONPATH`` spécifié dans ``config/config.dist.sh``. Si ce n'est pas le cas, créer un ``config/config.sh`` avec la valeur correcte pour ``PYTHONPATH``. Par exemple pour Debian, mettre cette valeur:

source: If you go to the portal, the QR codes, short link and features identification should work as expected. Search will be enable in the next section.
fr: Si vous aller sur le géoportail, le QR code, l'URL abrégée et l'interrogation d'attributs devraient fonctionner. La recherche sera mise en place dans la section suivante.

source: Portal page with QR code and short link
fr: Page du géoportail avec le QR code et l'URL abrégée

source: If you test the get features capability, you will only get a very basic presentation: it is what MapServer returns to the GetFeatures request. You improve this if you with access to the database. See :ref:`the relevant section of the documentation <ref_sysadmin_db_features>`.
fr: Si vous testez l'interrogation d'attributs, vous aurez seulement une présentation très basique: c'est ce que MapServer retourne lors de la requête GetFeatures. Vous pouvez l'améliorer avec l'accès à la base de données. Voir :ref:`la partie traitant de ce sujet dans la documentation <ref_sysadmin_db_features>`.

source: Search
fr: Recherche

source: Create global search configuration:
fr: Créer une configuration globale de recherche

source: At this point, this command should return with this error: ``Job for searchd@customer-infra.service failed because the control process exited with error code.`` This is expected.
fr: À ce point de la mise en place du géoportail, cette commande devrait retourner une erreur: ``Job for searchd@customer-infra.service failed because the control process exited with error code.`` C'est normal.

source: Add a symlink to the newly created sphinx configuration (*this must be done as root*):
fr: Ajouter un lien symbolique vers la nouvelle configuration sphinx qui vient d'être créée (*ceci doit être effectué en tant que root*):

source: On Debian based systems, before creating the symlink, you must (*as root*):
fr: Pour les systèmes basés sur Debian, avant de créer le lien symbolique, vous devez (*en tant que root*):

source: Create the ``/etc/sphinx/`` directory: ``mkdir /etc/sphinx/``
fr: Créer le dossier ``/etc/sphinx/`` : ``mkdir /etc/sphinx/``

source: Change its owner to ``sphinxsearch``: ``chown -R sphinxsearch:sphinxsearch /etc/sphinx``
fr: Mettre ``sphinxsearch`` comme propriétaire : ``chown -R sphinxsearch:sphinxsearch /etc/sphinx``

source: Create sphinx infrastructure specific directories (*this must be done as root*):
fr: Créer les dossiers spécifiques à l'infrastructure de sphinx (*ceci doit être fait en tant que root*) :

source: Create: ``mkdir -p /var/lib/sphinx/customer-infra/{binlog,index}``
fr: Créer : ``mkdir -p /var/lib/sphinx/customer-infra/{binlog,index}``

source: Set proper owner: ``chown -R sphinx:sphinx /var/lib/sphinx/customer-infra``
fr: Paramétrer le bon propriétaire : ``chown -R sphinx:sphinx /var/lib/sphinx/customer-infra``

source: Create log dir: ``mkdir -p /var/log/sphinx``
fr: Créer le dossier pour les logs : ``mkdir -p /var/log/sphinx``

source: Set proper owner: ``chown -R sphinx:sphinx /var/log/sphinx``
fr: Lui attribuer le bon propriétaire : ``chown -R sphinx:sphinx /var/log/sphinx``

source: Create run dir for PID: ``mkdir -p /var/run/sphinx``
fr: Créer le dossier run pour PID : ``mkdir -p /var/run/sphinx``

source: Set proper owner: ``chown -R sphinx:sphinx /var/run/sphinx``
fr: Lui attribuer le bon propriétaire : ``chown -R sphinx:sphinx /var/run/sphinx``

source: On Debian based system:
fr: Pour les systèmes basés sur Debian :

source: The correct user is ``sphinxsearch``
fr: Le bon utilisateur est ``sphinxsearch``

source: Don't attempt to create the directories above in ``/var/lib/sphinxsearch`` the process will be configured to look in ``/var/lib/sphinx``
fr: N'essayez pas de créer les dossiers ci-dessus dans ``/var/lib/sphinxsearch`` le processus sera configuré pour utiliser ``/var/lib/sphinx``

source: Deploy the unit files for this infrastructure (*this must be done as root*):
fr: Deployer les fichiers ``.service`` pour cette infrastructure (*ceci doit être fait en tant que root*) :

source: Copy the service files: ``cp /path/to/geo-infra/searchd@.service /etc/systemd/system/``
fr: Copier les fichiers ``.service``: ``cp /path/to/geo-infra/searchd@.service /etc/systemd/system/``

source: On Debian based systems, you must correct the user to ``sphinxsearch`` in the unit file.
fr: Pour les systèmes basés sur Debian, il changer l'utilisateur pour ``sphinxsearch`` dans ``searchd@.service``.

source: Reload systemd daemons: ``systemctl daemon-reload``
fr: Recharger les démons systemd : ``systemctl daemon-reload``

source: Download the `data needed by sphinx to build its indexes </data/getting-started/places.csv>`__ and put in it ``customer-infra/data``:
fr: Télécharger les `données nécessaires à sphinx pour construire ses index </data/getting-started/places.csv>`__ et les placer dans ``customer-infra/data`` :

source: Start sphinx: ``./manuel restart-service search customer-infra``
fr: Démarrer sphinx : ``./manuel restart-service search customer-infra``

source: Trigger a reindex: ``./manuel reindex customer-infra``
fr: Lancer une ré-indexation : ``./manuel reindex customer-infra``

source: Search should work as expected.
fr: La recherche devrait maintenant fonctionner.

source: Search with a database
fr: Recherche avec une base de données

source: In real case senario, you probably want the locations to come from your database and not some CSV file. To do that, you can use the template below as ``customer-infra/search/portal-locations.in.conf``:
fr: Dans des cas concrets, vous voudrez sûrement que les données de la recherche proviennent de votre base de données et pas d'un fichier csv. Pour faire ça, vous pouvez utiliser les modèles ci-dessous dans ``customer-infra/search/portal-locations.in.conf``:

source: In that case, you must configure the search in your ``config/_common.dist.toml`` to have access to the database and to convert origins to ranks:
fr: Dans ce cas, vous devrez configurer la recherche dans votre fichier ``config/_common.dist.toml`` pour avoir accès à la base de données et pour convertir les origines en rangs:

source: View the :ref:`relevant page of the documentation for more information on this<ref_user_cfg-portal_search>`.
fr: Aller sur la :ref:`page sur ce sujet de la documentation pour plus d'information<ref_user_cfg-portal_search>`.

source: Print
fr: Impression

source: Download the `print WAR </data/getting-started/print.war>`__:
fr: Télécharger le `print WAR </data/getting-started/print.war>`__ :

source: Do the following actions as root:
fr: Faire les actions suivantes en tant que root :

source: Copy the WAR in your tomcat webapps folder (eg ``/usr/share/tomcat/webapps``, ``/srv/tomcat/webapps/`` or ``/var/lib/tomcat8/webapps``) under the name ``print-customer-infra.war``.
fr: Copier le WAR dans votre dosser tomcat webapps (par exemple ``/usr/share/tomcat/webapps``, ``/srv/tomcat/webapps/`` or ``/var/lib/tomcat8/webapps``) en utilisant le nom ``print-customer-infra.war``.

source: Start tomcat: ``systemctl start tomcat``
fr: Démarrer tomcat: ``systemctl start tomcat``

source: On Debian based systems, the target is named ``tomcat8``
fr: Pour les systèmes basés sur Debian, la cible est appelée ``tomcat8``

source: Go to the tomcat webapps folder.
fr: Aller au dossier tomcat webapps.

source: Check that ``print-customer-infra.war`` is correctly deployed.
fr: Vérifier que ``print-customer-infra.war`` est correctement déployé.

source: Create the ``print-customer-infra/print-apps`` directory and make it owned by tomcat:
fr: Créer le dossier ``print-customer-infra/print-apps`` et donner lui comme propriétaire tomcat :

source: On Debian based systems, the correct user is ``tomcat8``.
fr: Pour les systèmes basés sur Debian, le nom de l'utilisateur est ``tomcat8``.

source: Check and correct permissions on ``<tomcat-webapps>/print-customer-infra/print-apps``:
fr: Contrôler et corriger les permissions pour ``<tomcat-webapps>/print-customer-infra/print-apps`` :

source: Check that with the user you are using to run ``./manuel`` in ``geo-infra`` you can access this directory. If ``ls <tomcat-webapps>/print-customer-infra/print-apps`` returns successfuly, you are good to go. If not, correct the permissions to give it read and execute access on all folders on the path.
fr: Contrôler que, avec l'utilisateur que vous utilisez pour lancer ``./manuel`` dans ``geo-infra`` vous pouvez accéder à ce dossier. Si ``ls <tomcat-webapps>/print-customer-infra/print-apps`` ne retourne pas d'erreur, vous pouvez continuer. Si ce n'est pas le cas, corriger les permissions pour avoir un accès en lecture et execution sur tous les dossiers dans le chemin.

source: Setup ACL to give the user write permissions to the directory (**don't use standard unix permissions, it breaks tomcat's expectations**): ``setfacl -m u:<user>:rwx print-customer-infra/print-apps``.
fr: Configurer les ACL pour donner à l'utilisateur les permissions d'écrire dans le dossier (**ne pas utiliser les permissions standards d'Unix, ça ne va pas fonctionner avec tomcat**): ``setfacl -m u:<user>:rwx print-customer-infra/print-apps``.
