Repository: ioda-net/geo-infra
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Check that tomcat has an AJP connector defined on port 8009 in ``/etc/tomcat/server.xml``. If not, add the line below in the ``<Service name="Catalina">`` section:
fr: Contrôler que tomcat a un connecteur AJP défini pour le port 8009 dans ``/etc/tomcat/server.xml``. Sinon, ajouter la ligne ci-dessous dans la section ``<Service name="Catalina">`` :

source: Restart tomcat ``systemctl resart tomcat``
fr: Redémarrer tomcat ``systemctl resart tomcat``

source: Go to ``geo-infra``
fr: Aller dans ``geo-infra``

source: Export your value of MPF_APP_FOLDER to allow manuel to copy it to the correct location. For instance: ``export MFP_APP_FOLDER="/usr/share/tomcat/webapps/print-customer-infra/print-apps/"``
fr: Exporter votre valeur de MPF_APP_FOLDER pour permettre à manuel de la copier au bon endroit. Par exemple : ``export MFP_APP_FOLDER="/usr/share/tomcat/webapps/print-customer-infra/print-apps/"``

source: Copy print configuration: ``./manuel tomcat-copy-conf "dev" demo``
fr: Copier la configuration d'impression : ``./manuel tomcat-copy-conf "dev" demo``

source: Check that you have a ``demo`` folder in ``<tomcat-webapps>/print-customer-infra/print-apps``.
fr: Contrôler que vous avez un dossier ``demo`` dans ``<tomcat-webapps>/print-customer-infra/print-apps``.

source: If so, try to print in the portal. It should work as expected.
fr: Si c'est bien le cas, essayez d'imprimer depuis votre géoportail. Tout devrait fonctionner.

source: Unset the MFP_APP_FOLDER variable: ``unset MFP_APP_FOLDER``
fr: Désactiver la variable MFP_APP_FOLDER : ``unset MFP_APP_FOLDER``

source: In ``config/config.sh`` add a line like this: ``set-var MFP_APP_FOLDER "/usr/share/tomcat/webapps/print-customer-infra/print-apps/"`` that corresponds to the correct path to MapFish Print. It will now be used automatically by the scripts.
fr: Dans ``config/config.sh`` ajouter une ligne comme ceci: ``set-var MFP_APP_FOLDER "/usr/share/tomcat/webapps/print-customer-infra/print-apps/"`` qui correspond au bon chemin de MapFish Print. C'est ce qui sera dorénavant utilisé automatiquement par les scripts.

source: Everything should work correctly now. You can now rebuild the configuration of the portal with ``./manuel dev demo`` or rebuild everything with ``./manuel dev-full demo``.
fr: Tout devrait fonctionner correctement maintenant. Vous pouvez reconstruire la configuration du géoportail avec ``./manuel dev demo`` ou tout reconstruire avec ``./manuel dev-full demo``.
